In [1]:
import pandas as pd

>pandas 를 import 하고 ps 라는 단축어로 사용
---

## pd.DataFrame

### Dictionary 형식으로 DataFrame 만들기

In [2]:
friend_dict_list = [
    {'name': 'John', 'age': 25, 'job': 'student'},
    {'name': 'Nate', 'age': 30, 'job': 'teacher'},
]

In [3]:
df = pd.DataFrame(friend_dict_list)

In [4]:
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

>dictionary 의 데이터는 순서가 없음으로 Column 의 순서를 수정해야 할 경우가 발생할 수 있다.
---

In [5]:
df = df[['name','age','job']]

In [6]:
# 왜 [[  ]] 대괄호가 2개가 들어가지?

In [7]:
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

>dictionary 의 데이터는 순서가 없음으로 Column 의 순서 수정
---

### Ordered Dictionary 형식으로 DataFrame 마들기

In [8]:
from collections import OrderedDict

>OrderedDict = Dictionary 데이터의 key 순서를 보장해 주는 기능
---

In [9]:
friend_ordered_dict = OrderedDict(
    [
        ('name', ['John', 'Nate']),
        ('age', ['25', '30']),
        ('job', ['student', 'teacher'])
    ]
)

>OrderedDict 데이터 형식은 일반 Dict 와 차이가 있음
---

In [10]:
pd.DataFrame.from_dict(friend_ordered_dict)

   name age      job
0  John  25  student
1  Nate  30  teacher

>pd.DataFrame.from_dict(ordered_dict)
---

In [11]:
pd.DataFrame(friend_ordered_dict)

   name age      job
0  John  25  student
1  Nate  30  teacher

In [12]:
# ?? pd.DataFrame() 으로 생성해도 결과 값이 나오는 이유는 뭐지??

### List 형식으로 DataFrame 만들기

In [13]:
friend_list = [
    ['Jone', 20, 'student'],
    ['Nate', 30, 'teacher']
]

In [14]:
column_name = ['name','age','job']

In [15]:
pd.DataFrame.from_records(friend_list, columns = column_name)

   name  age      job
0  Jone   20  student
1  Nate   30  teacher

In [16]:
pd.DataFrame(friend_list, columns = column_name)

   name  age      job
0  Jone   20  student
1  Nate   30  teacher

In [17]:
#.from_records 는 무엇인가??

>.from_records 는 무엇인가?? 없어도 똑같이 만들어 진다...
---

In [18]:
friend_list2 = [
        ['name', ['John', 'Nate']],
        ['age', ['25', '40']],
        ['job', ['student', 'teacher']]
]

In [19]:
# pd.DataFrame.from_items(friend_list2)
# pd.DataFrame.from_items() 는 사용이 중지되었다.

In [20]:
pd.DataFrame.from_dict(dict(friend_list2))

   name age      job
0  John  25  student
1  Nate  40  teacher

In [21]:
pd.DataFrame.from_dict(OrderedDict(friend_list2))

   name age      job
0  John  25  student
1  Nate  40  teacher